Given the DataFrame given below we will perform the following analysis:

In [53]:
import numpy as np 
import pandas as pd

df = pd.DataFrame({
    'From_to':['LoNDon_paris','MADrid_MiLan','lonDOn_StockHOLm','BuDAPest_PAriS','Brussels_lonDon'],
    'FlightNumber':[10045,np.nan,10065,np.nan,10085],
    'RecentDelays':[[23,47],[],[24,43,87],[13],[67,32]],
    'Airline':['KLM(!)','<Air France>(12)','(British Airways.)','12.Air France',"Swiss Air"]
})

 1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [54]:
df.dtypes

From_to          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [55]:
df

            From_to  FlightNumber  RecentDelays             Airline
0      LoNDon_paris       10045.0      [23, 47]              KLM(!)
1      MADrid_MiLan           NaN            []    <Air France>(12)
2  lonDOn_StockHOLm       10065.0  [24, 43, 87]  (British Airways.)
3    BuDAPest_PAriS           NaN          [13]       12.Air France
4   Brussels_lonDon       10085.0      [67, 32]           Swiss Air

In [56]:
# Make the 'FlightNumber' column a int nut first we need to fill the na values
df.FlightNumber.fillna(value = df.FlightNumber[0]+10,limit=1,inplace=True)
df.FlightNumber.fillna(value = df.FlightNumber[2]+10,limit=1,inplace=True)
df.FlightNumber = df.FlightNumber.astype(np.int64)
df

            From_to  FlightNumber  RecentDelays             Airline
0      LoNDon_paris         10045      [23, 47]              KLM(!)
1      MADrid_MiLan         10055            []    <Air France>(12)
2  lonDOn_StockHOLm         10065  [24, 43, 87]  (British Airways.)
3    BuDAPest_PAriS         10075          [13]       12.Air France
4   Brussels_lonDon         10085      [67, 32]           Swiss Air

In [57]:
df.FlightNumber.dtype

dtype('int64')

2. The FromTo column would be better as two separate columns! Split each string on the underscore delimiter to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [58]:
df

            From_to  FlightNumber  RecentDelays             Airline
0      LoNDon_paris         10045      [23, 47]              KLM(!)
1      MADrid_MiLan         10055            []    <Air France>(12)
2  lonDOn_StockHOLm         10065  [24, 43, 87]  (British Airways.)
3    BuDAPest_PAriS         10075          [13]       12.Air France
4   Brussels_lonDon         10085      [67, 32]           Swiss Air

In [59]:
df.From_to.str.split('_')

0        [LoNDon, paris]
1        [MADrid, MiLan]
2    [lonDOn, StockHOLm]
3      [BuDAPest, PAriS]
4     [Brussels, lonDon]
Name: From_to, dtype: object

In [60]:
df[['From','To']] = df.From_to.str.split('_').to_list()
df.drop('From_to',inplace=True,axis=1)

3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [61]:
df.From = df.From.str.capitalize()
df.To = df.To.str.capitalize()

In [62]:
df

   FlightNumber  RecentDelays             Airline      From         To
0         10045      [23, 47]              KLM(!)    London      Paris
1         10055            []    <Air France>(12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways.)    London  Stockholm
3         10075          [13]       12.Air France  Budapest      Paris
4         10085      [67, 32]           Swiss Air  Brussels     London

In [63]:
df = df [['From','To','FlightNumber','RecentDelays','Airline']]
df

       From         To  FlightNumber  RecentDelays             Airline
0    London      Paris         10045      [23, 47]              KLM(!)
1    Madrid      Milan         10055            []    <Air France>(12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways.)
3  Budapest      Paris         10075          [13]       12.Air France
4  Brussels     London         10085      [67, 32]           Swiss Air

4 .In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [64]:
delays = pd.DataFrame(df.RecentDelays.to_list(),columns=['delay_1','delay_2','delay_3'])
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [65]:
df.drop('RecentDelays',inplace=True,axis=1)

/usr/local/lib/python3.7/dist-packages/pandas/core/frame.py:4174: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [66]:
df

       From         To  FlightNumber             Airline
0    London      Paris         10045              KLM(!)
1    Madrid      Milan         10055    <Air France>(12)
2    London  Stockholm         10065  (British Airways.)
3  Budapest      Paris         10075       12.Air France
4  Brussels     London         10085           Swiss Air

In [67]:
df.insert(loc=3,column='delay_1',value=delays.delay_1)
df.insert(loc=4,column='delay_2',value=delays.delay_2)
df.insert(loc=5,column='delay_3',value=delays.delay_3)

In [68]:
df

       From         To  FlightNumber  ...  delay_2  delay_3             Airline
0    London      Paris         10045  ...     47.0      NaN              KLM(!)
1    Madrid      Milan         10055  ...      NaN      NaN    <Air France>(12)
2    London  Stockholm         10065  ...     43.0     87.0  (British Airways.)
3  Budapest      Paris         10075  ...      NaN      NaN       12.Air France
4  Brussels     London         10085  ...     32.0      NaN           Swiss Air

[5 rows x 7 columns]